d3=0.0003;     %slit3宽度
run('a3.m')
disp('这是a3_0.3脚本结束');

d3=0.001;     %slit3宽度
run('a3.m')
disp('这是a3_1脚本结束');

d3=0.002;     %slit3宽度
run('a3.m')
disp('这是a3_2脚本结束');

d3=0.003;     %slit3宽度
run('a3.m')
disp('这是a3_3脚本结束');

d3=0.004;     %slit3宽度
run('a3.m')
disp('这是a3_4脚本结束');

d3=0.005;     %slit3宽度
run('a3.m')
disp('这是a3_5脚本结束');

d3=0.006;     %slit3宽度
run('a3.m')
disp('这是a3_6脚本结束');
%% 
% 
% d3=0.003;     %slit3宽度
% run('a3.m')
% disp('这是a3_3脚本结束');
% 
% d3=0.0035;     %slit3宽度
% run('a3.m')
% disp('这是a3_3.5脚本结束');
% 
% d3=0.0045;     %slit3宽度
% run('a3.m')
% disp('这是a3_4.5脚本结束');

% d3=0.0055;     %slit3宽度
% run('a3.m')
% disp('这是a3_5.5脚本结束');

% d3=0.0065;     %slit3宽度
% run('a3.m')
% disp('这是a3_6.5脚本结束');
% 
% d3=0.007;     %slit3宽度
% run('a3.m')
% disp('这是a3_7脚本结束');